{'current': ['speaker 1: how is the preparation for your exam going?', "speaker 2: it's not.. really.  i've been procrastinating a bit.  any tips on how to buckle down?", 'speaker 1: procrastinating is a hard habit to break. just stop doing it.', "speaker 2: haha easier said than done!  kind of like monitoring your blood sugar, how's that going for you lately?  do you feel well?", "speaker 1: you are right my friend. it's still all over the place.", 'speaker 2: how does that work?  is it based on what you eat or is hereditary?  would exercising more help at all?', 'speaker 1: they told me that i got it by eating wrong in the first place by eating bad most of my life.', "speaker 2: oh, yeah, that's how my mom is.  she's right at the point where if it gets any higher she would be technically diabetic and have to be put on medicine.  do you take any medicine for it?", 'speaker 1: i use to but through time i was able to control it with diet. i think i got off kilter at christmas with all the deserts. here we go bad habitslol', "speaker 2: oh, don't even get me started on how much i ate around the holidays, not just christmas day! lol i think i gained at least 5 pounds from cookies alone!", 'speaker 1: you know i did literally gain 10 pounds between november and december. ', "speaker 2: with spring coming soon, i'm sure there will be more ways to burn it off with outside activities.  it's hard to lose weight being cooped up in the house all winter!"], 'persona_list': ['Speaker 2 enjoys playing with dogs.', 'Speaker 2 teaches drums and plays them well.', 'Speaker 2 prioritizes health and works out despite not liking it.', 'Speaker 2 has a health issue with blood sugar.', 'Speaker 1 is a student and is reading for an exam.', 'Speaker 1 wants to get a pit bull as a pet when they finish school.', "Speaker 1 has a busy schedule and doesn't have time for sports.", 'Speaker 1 comes from a family that values fitness and works out regularly.', "Speaker 1 is concerned about speaker 1's health and wishes them well."]}
{'current': ['speaker 1: i picked some vegetables from my garden', 'speaker 2: what kind of vegetables do you grow?', "speaker 1: tomatoes, squash, potatoes, lettuce, and a few herbs. i'm also trying out cucumbers for the first time this year, but it's not going so well. something keeps eating them. i have lots of tomatoes. do you want some?", 'speaker 2: i would love some tomatoes. they are my favorite vegetable..well technically fruit (but that is my environmental engineer background coming out, haha). what kind of food do you make with you vegetables?', "speaker 1: i've been trying a lot of new recipes lately. i made a squash soup with fresh rosemary the other day that was delicious! did you make it to the park to hike last weekend?", 'speaker 2: yum!! that sounds so good! yes i did, i went on a 5 mile hike. i was actually going to camp overnight but the weather got bad so i turned back. maybe next time. but i did get some great photos! would you like to see them?', "speaker 1: i would love to! you're such a good photographer. i think you missed your calling. i wish i had more time to get outdoors these days. work is killing me.", "speaker 2: aww thank you. it's definitely my favorite hobby. i think i'll start a website showcasing my photos. what do you think?", "speaker 1: i think that's a great idea. or you could try to show at the art crawl they do every month. i don't think it costs very much to participate, and you might sell some prints. then i could say i know a famous artist. ", "speaker 2: hey that is a fantastic idea! i'll even give you a discount! (haha just kidding - you can have some for free). i think you should try and take a break from work when you can and maybe we can go on a nice long hike together.", 'speaker 1: i would love that. work should slow down soon. i have a lot of move-out cleanings to do, which are only one time jobs. maybe next weekend?', "speaker 2: that works for me! there's a nice little hike to a waterfall that i'd love to do. we can take some cool photos too!"], 'persona_list': ['Speaker 2 is a housekeeper for three families in their area.', 'Speaker 2 loves the outdoors, especially in the fall and winter.', 'Speaker 2 enjoys gardening and growing their own vegetables.', 'Speaker 2 values healthy eating.', 'Speaker 1 is an environmental engineer.', 'Speaker 1 has outdoor hobbies such as hiking and taking photos.', 'Speaker 1 is single.', 'Speaker 1 enjoys hiking and taking photos in the outdoors.', 'Speaker 1 values the environment and healthy living.']}
{'current': ['speaker 1: how is school going? ', 'speaker 2: going well, on my computer all the time. how are you?', "speaker 1: does it ever get tiring staring at a computer all day?  i get headaches sometimes when i have to.  i'm doing alright.  i'm enjoying all the snow we are getting.", 'speaker 2: sometimes it does get tiring. are you getting enough sun still?', "speaker 1: eh, it's been pretty cloudy lately.  it's been snowing several days a week.", 'speaker 2: is your car handling the snow well?', "speaker 1: it's a little sedan, so it", "speaker 2: i see. and how's your wheelchair handling in snowy conditions?", "speaker 1: sorry, sent that last one a bit early by accidentally hitting send!  the wheelchair doesn't do too well in the snow and neither does the sedan.  what kind of vehicle to you drive?  ", "speaker 2: i drive a truck but it's not as snowy over here these days. i hope you're getting help with the chair.", 'speaker 1: i wish i had a truck.  the city side walks are usually pretty good.  the snow is bad on the side walks in the neighborhoods.', "speaker 2: i understand. that sounds difficult but i know you'll manage."], 'persona_list': ['Speaker 2 is in a wheelchair', 'Speaker 2 likes cooler weather', 'Speaker 2 is concerned about colds', 'Speaker 2 has a passion for vitamin c', 'Speaker 2 has a supportive vestie who bought them a car', 'Speaker 2 values friendship', 'Speaker 1 is in school for computer engineering', 'Speaker 1 has a passion for computer programming', 'Speaker 1 hopes to open their own company with their best friend', 'Speaker 1 is gay', 'Speaker 1 values determination and perseverance']}
{'current': ['speaker 1: did you manage to fix your friends computer? ', "speaker 2: i did thankfully, strangest thing with that. i thought it would be a software issue but it wasn't. the machine was literally filled with dust, had to give it a thoroughly good cleaning.", 'speaker 1: oh dear, grim! i bet you see some horrible things in computers? what are you planning to eat this weekend italian or grill?', "speaker 2: why not both? we recently got an extension placed on the grill so we can do pizza, so i think we'll just have a smattering of both, how about you? having some italian this weekend?", "speaker 1: omg, that sounds amazing - i've always wanted a pizza add-on to the grill but my wife won't let me, she's a purist! yeah she's away, so it's a pizza night in front of the tv for me ;) what's your favourite topping? ", "speaker 2: i'd have to say cheese, definitely a must for my pizza, what about yourself?", 'speaker 1: definitely cheese, but i do love olives on top of pizza as well! deep pan or thin pizza base? ', "speaker 2: i like think personally, easier on the stomach, otherwise it's just too starchy!", "speaker 1: yeah fair enough - it's closer to the original italian pizza as well! how's your families farm doing? i saw that they'd recently bought some more cows? ", "speaker 2: cows, sheep, chickens and even a mongoose. where they keep getting these from i don't know, i feel like babe among the animals! what's your favourite animal?", "speaker 1: haha a mongoose?! that's amazing! are the all friendly? my favourite animal is a tiger, but i don't think you could keep one on a farm! ", "speaker 2: not with that attitude, i've learned from my time on the farm that if you put in the effort any animal can be tamed. the mongoose and the chickens are now awfully close to each other, i think they're planning something.. something menacing!"], 'persona_list': ['Speaker 2 loves to cook.', 'Speaker 2 immigrated to the united states when they were 14.', 'Speaker 2 speaks italian and english.', 'Speaker 2 has three children.', 'Speaker 2 was married off when they were younger.', 'Speaker 2 feels angry about being married off, but has accepted it.', 'Speaker 2 is a realist and tries to accept what they can not change.', "Speaker 1 is trying to fix their friend's computer.", 'Speaker 1 loves italian food.', 'Speaker 1 was raised on a farm.', 'Speaker 1 encourages the use of meat in cooking.', 'Speaker 1 grills frequently.', "Speaker 1 is supportive of speaker 1's experiences and views."]}
{'current': ['speaker 1: what is your favorite japanese anime to watch?', 'speaker 2: crayon shin-chan is my favorite anime. my interested first piqued after reading crayon shin-chan manga and i started buying cds to watch the anime dubbed in english. i hope to visit japan next year to buy crayon shinchan products. ', "speaker 1: oh, very nice.  i don't really read anime much.  i like american comics more than japanese.  ", 'speaker 2: i used to love american comics too such as archie but the more i read, the stories are usually very predictable that i gradually lost interest. what else do you do in your free time?', 'speaker 1: i see what you mean. i really love to get outdoors and go hiking or camping.  have you ever done anything like that?', "speaker 2: yes, i love going outdoors too. that's why i can't wait to go to japan. not only are there plenty of anime character products to buy, they boost amazing hiking opportunities. hiking mount fuji is at the top of my list. ", "speaker 1: oh yeah, that is quite goal!  i've never really looked into doing much hiking outside of the us.  i might have to start exploring that as a future option for me.  what else to you want to do when you get to japan?", "speaker 2: there's so much to do in japan! i'm also going to disneyland tokyo located in chiba, kayak in okinawa, go shopping for funky jap style clothes and last but not least, eat to my heart's content. japanese snacks are awesome -- did you know that they have around 100 flavors of kit kat?", 'speaker 1: now you are talking my language!  i love kit kat!  i think i would have to try all 100 flavors.  is disneyland tokyo any different than here in the us?', 'speaker 2: i have yet to find out! probably same in some ways and different in other ways. if you are interested in going to japan, i will share my trip details with you. i have booked a trip with contiki tours to japan. so far i have already paid the down payment and my trip will be departing in february 2022', 'speaker 1: that sounds like a great time, and yes, i would love to hear about it.  february 2022 sounds like a long time to wait, but it will give you lots of time to save up money for spending.  ', "speaker 2: cool! let's meet up next week so i can entice you to go!"], 'persona_list': ['Speaker 2 is curious about other cultures.', 'Speaker 2 has not seen anything in japanese.', 'Speaker 2 finds it difficult to save money for trips.', 'Speaker 1 is studying japanese.', 'Speaker 1 is tired of reading subtitles.', 'Speaker 1 enjoys japanese cartoons and anime.', 'Speaker 1 hopes to visit japan one day.', 'Speaker 1 is saving money for a trip to japan.', 'Speaker 1 has a hobby of watching japanese cartoons and anime.']}
{'current': ['speaker 1: hey thanks for your support last week, we should hang out.', 'speaker 2: no problem. we definitely should hang out sometime! is there a coffee shop near your place?', 'speaker 1: yeah theres a nice place a few blocks from me we could go to.  this would be out of the ordinary for me, i dont really like taking journeys.', "speaker 2: that's ok! we could always go somewhere familiar to you. there's a dog park near my house that just opened up! we could take my puppy.", 'speaker 1: yeah thats a good idea,  what kind of puppy do you have?', "speaker 2: he's a shih tzu. i got him a few weeks ago! he's super tiny. do you have any pets?", 'speaker 1: i dont have any pets, i still like with my parents and they dont like animals.  have you ever thought about people who arent sure of their gender?', "speaker 2: i'm not sure i have thought about that a lot. what makes you ask?", 'speaker 1: sometimes i get curious about genders, sometimes i wonder if maybe my gender is wrong.', "speaker 2: it could be, if that's how you feel. have you tried talking to a therapist? ", 'speaker 1: i tried talking to my doctor but he didnt take me seriously because im still in high school.', "speaker 2: you should try and find a therapist or psychologist. they're good for helping you and the talking can really help you discover yourself."], 'persona_list': ["Speaker 2 lives up to their parents' standards", 'Speaker 2 fears rejection', 'Speaker 2 is unsure of themselves and their feelings', 'Speaker 2 sometimes thinks about being a different gender', 'Speaker 2 is attracted to unknown things', 'Speaker 2 does not like to go on journeys', 'Speaker 1 walks their own path', 'Speaker 1 is confident and encouraging', 'Speaker 1 has a sense of adventure (wants to go to paris)', 'Speaker 1 is a dog lover', 'Speaker 1 is on a journey of self-discovery', 'Speaker 1 has no standards but to be oneself', 'Speaker 1 enjoys moments rather than following standards.']}
{'current': ['speaker 1: i have been packing up my belongings and working on some new art projects.', 'speaker 2: oh??  what is your best selling type of art?', "speaker 1: i like to sculpt primarily, usually welding metal together.  my style is fairly avant garde.  that has usually done fairly well, and i've built a small following.", 'speaker 2: oh nice... hopefully that following has friends who enjoy it and you can start making a small fortune from it all.  do you think you will keep your following when you move?', "speaker 1: i think so, i will have to move my studio, but most of my art can be found online, so i hope to just reach more people with the move.  how's teaching going?", 'speaker 2: it is great... we are currently learning about area and volume.  it is fun to watch the kids who struggle with the mathematics of math fly through geometry while their counterparts struggle.', "speaker 1: that's exciting, it must be fun to watch your students learn and grow.  have you always taught math?", 'speaker 2: well originally i taught elementary school, but i moved up to math 10 years ago.  and i will never go back.  have you considered teaching art in a school setting?', "speaker 1: that's interesting.  and no, i've thought about doing school tours, participated in art-focused assemblies and the like, but not about teaching art full time.  i didn't study art in school so much, i sort of came across it on my own, so teaching a whole course would be difficult i think."], 'persona_list': ['Speaker 2 enjoys hiking', 'Speaker 2 is an expert in speaking french', 'Speaker 2 has two collies', 'Speaker 2 is moving to a neighboring state soon', 'Speaker 1 teaches middle school', 'Speaker 1 relaxes by singing in a bar on weekends', 'Speaker 1 likes sports, especially football', 'Speaker 1 has a favorite volleyball team', 'Speaker 1 is allergic to apples', 'Speaker 1 has a hobby of crocheting', 'Speaker 1 does not have time for pets']}
{'current': ["speaker 1: i started reading a new novel series. it's very much like agatha christie. i think i found something to keep me going.", "speaker 2: that's great!  has your father written anything new recently?", 'speaker 1: no.  he was an author, but has been retired for a couple of years now.', "speaker 2: i'm glad he is able to enjoy retirement. are you planning to travel anywhere soon? i still haven't made it to ireland but it is on the bucket list for sure.", "speaker 1: no plans right now, but i'd love to go back to ireland.  i stayed in dublin last time i was there.  would love to visit the other side of the island. maybe around galway.  are you irish?  that's wht i went.  wanted to see the ancestral home. ", "speaker 2: i'm not irish i just love the pictures and things i've seen from there it looks absolutely beautiful and i'd love to learn more about the culture.", 'speaker 1: it is beautiful there.  if you get the chance its definitely worth the trip.  how old are your children?', "speaker 2: hopeful i may be able to go in the next few years  but we will see. my kids are 6, 4, 2 and the twins would've been 9 next month. ", "speaker 1: i'm very sorry for your loss.  ", 'speaker 2: thank you. it has been 5 years now and i am thankful that i got the time with them that i did even though it was just a few days. they were born very premature due to being twins so the odds were definitely stacked against them. my family is planning to go plant some more sunflowers for them on their birthday.', "speaker 1: it's good to keep their memory alive.  ", 'speaker 2: yes i love telling my kids about their big sisters and i will always say i am a mother of 5. do you have any kids?'], 'persona_list': ['Speaker 2 has just returned from australia.', 'Speaker 2 has a interest in ireland.', 'Speaker 2 has a family background in ireland.', 'Speaker 2 enjoys traveling.', 'Speaker 2 enjoys reading.', 'Speaker 2 had a famous author as a father.', 'Speaker 1 is a church food pantry worker.', 'Speaker 1 has 5 children, 2 of whom have passed away.', 'Speaker 1 has a hobby of growing sunflowers.', 'Speaker 1 enjoys reading agatha christie novels.', 'Speaker 1 has a history of suicide pact with her husband.', 'Speaker 1 is managing well for herself and family.', 'Speaker 1 would like to visit ireland.']}
{'current': ['speaker 1: i have applied for a few new jobs today.  ', 'speaker 2: what kind of job are you looking for? ', "speaker 1: something in writing.  my major was journalism.  it's so hard to find a job though!", 'speaker 2: i heard some third party ticket sites are looking to hire experienced scalpers to write articles for them. you might be interested in that?', "speaker 1: i'd love the info for that!  it would be easy to write about something i love to do and i'm good at!!  have you done any swimming lately?", "speaker 2: yeah, i'll send you a link. i saw an ad for it earlier this week. unfortunately, i haven't been swimming much it's been really cold outside! i wish my gym had an indoor heated pool.", "speaker 1: yeah, all gyms should have one!  especially if you don't live in a tropical climate!  have you looked into any new jobs since you left your last one?", "speaker 2: yeah, i'm working at a company called slickdeals. they deal with a lot of online shopping and finding deals for people. it's perfect for me.", "speaker 1: sounds perfect since you love online shopping!  i love finding good deals online!  i'll have to check out the company!  especially without having a job, i need to find good deals!  when did you start working there?", 'speaker 2: after i left my last job i went on a job hunt and found them. my work life balance has been great since i started and the company matches my values. all my coworkers are great too. we often go out for friday night drinks.', "speaker 1: that's great!  do you get to work from home or do you go into an office?", 'speaker 2: we mainly work at the office, but if you want to work from home you can call in. the company is pretty flexible overall. if you to try applying i can recommend you to the recruiter.'], 'persona_list': ['Speaker 2 is an athlete.', 'Speaker 2 misses family.', 'Speaker 2 is figuring out life after graduation.', 'Speaker 2 enjoys shopping online, especially scalping concert tickets.', 'Speaker 1 enjoys reading fantasy fiction novels.', 'Speaker 1 likes to swim.', 'Speaker 1 left a job at monsanto.', 'Speaker 1 is not good at being a life coach.', 'Speaker 1 has an addiction to shopping online.']}
{'current': ["speaker 1: we should go for a ride in your sports car while i'm in japan.", "speaker 2: that's a great idea! we can take my ferrari when we go to the beach for a day of swimming and relaxation. ", 'speaker 1: awesome. i can bring my outdoor music system too. what do you like to listen to?', "speaker 2: perfect! lately i've been into hip hop but i for our trip we definitely need to bring play some 90s classics on our trip too. ", 'speaker 1: sounds lovely. how well do you swim? i had a water accident when i was 5. i never go so far out in the ocean or sea.', "speaker 2: i'm a confident swimmer and am thinking about doing a triathlon soon. if you want to go swimming somewhere without currents or waves, we can always swim in my pool.", 'speaker 1: i like that better. we can go for the drive later. is your house near the beach?', 'speaker 2: i only live 15 minutes from the beach. we can swim at the pool during the day and then drive to the beach in the evening to get dinner and watch the sunset. ', 'speaker 1: that sounds very good. you make me look forward to the trip!! do you enjoy your job?', 'speaker 2: i love being an mc. i get to meet so many interesting people and love the unconventional schedule', 'speaker 1: you are so lucky. i work in a pharmacy, and so i mostly meet people at their lowest. ', 'speaker 2: that has to be tough some days, but you also get to give people the wonderful gift of giving them support when they need it most. '], 'persona_list': ['Speaker 2 enjoys swimming.', 'Speaker 2 prefers outdoor activities.', 'Speaker 2 listens to britney spears.', 'Speaker 2 brings pink items (swimsuit, towel, beach ball)', 'Speaker 2 is a fan of fast cars.', 'Speaker 1 has a giant house with both indoor and outdoor pools.', 'Speaker 1 is a rapper with a "fresh" and "og" reputation.', 'Speaker 1 has a pink ferrari.', 'Speaker 1 is picky about the people they hang out with (only hotties).', 'Speaker 1 enjoys fast cars and driving.']}
{'current': ['speaker 1: so have you gotten your tattoo yet?', "speaker 2: yea, i just got my second one on my ribs.  it's a heart, but gosh did it hurt!  do you have any tattoos?", "speaker 1: no, i don't. i am too afraid of the pain! do you plan on getting anymore?", "speaker 2: probably not, but you never know!  i only want ones that are really meaningful to me.  for now i'm happy with the ones that i have.  my other tattoo is a cross.", 'speaker 1: i can understand that. i think tattoos are cool! what other fun things have you done recently?', "speaker 2: it's been really cold out, but i like to go outside for walks on the milder days.  how about you?", 'speaker 1: i like walking, but i really enjoy swimming! it has been too cold to swim outside, so i have been swimming inside at a fitness center. do you like to swim?', "speaker 2: yes, i love swimming, but i only get to swim in the summer because i live near the ocean.  where do you swim when it's warmer?", 'speaker 1: mostly in outdoor pools because of the convenience. i also enjoy swimming in the ocean though! plus, we have a beautiful lake nearby. do you only swim in the ocean?', "speaker 2: mostly. sometimes i go to my friend's pool but the ocean is my favorite!", 'speaker 1: oh lucky! i have always wanted to have my own pool or a friend with one. how often do you swim?', "speaker 2: probably about 3 times a week during the summer.  i'm so lucky that i live so close to the ocean.  sometimes the rip tides get pretty bad though, so i have to be careful.  and yes, it's great having a friend with a pool. it's a saltwater pool too, so it doesn't dry out my skin.          "], 'persona_list': ['Speaker 2 is thinking about painting their room purple', 'Speaker 2 loves swimming and has been swimming since they were three', 'Speaker 2 might get a small swimmer tattoo', 'Speaker 2 is a female educator', 'Speaker 2 gets hit on by teenage boys at work, which is awkward', 'Speaker 1 is thinking about getting another tattoo', 'Speaker 1 is into recycling and might get the recycling logo tattooed', 'Speaker 1 drives a big blue van', 'Speaker 1 might be a hippie', 'Speaker 1 has a fun lifestyle and could teach speaker 1 a thing or two', "Speaker 1 is curious about speaker 1's lifestyle and finds it awkward that speaker 1 gets hit on by teenage boys at work."]}
{'current': ['speaker 1: have you taken any photographs recently?', 'speaker 2: yes! i need to send you some. i got some beautiful shots of the sunset last week and then i took some great photos of the bluebonnets that are in bloom.', 'speaker 1: yes please. i still have the picture you sent me of the candles melting. i bet you got great shots. my kids seem to be the only photos i take now.', 'speaker 2: that is still one of my all time favorites. nothing wrong with that children are such blessings. how have you been holding up? ', 'speaker 1: i agree. those 3 kids are my strength. i opened up my phone today and they took pictures to make me feel better while i am sick in bed still. i feel like i am getting better. i just have a runny nose. the candles you sent me are getting easier to smell, so i know i am recovering.', 'speaker 2: that is so good to hear. i am planning on swinging by tomorrow afternoon and dropping off dinner so you can rest and everyone will have full bellies with minimum effort. how is school going for your kiddos?', 'speaker 1: you are a life saver! thank you for thinking of us. school has been tough for the oldest since she is learning geometry and i forgot all about that. wait until you have kids and have to remember everything you learned in school. ', "speaker 2: of course its the least i could do. i bet that's tough hopefully she gets the hang of it soon enough. i'm hoping i get to be a momma in the next few years we will see.", 'speaker 1: that would be so nice for you! i feel like i want to have a village, but lately the kids are taking care of me in bed. maybe you can have a little family of photographers!', 'speaker 2: you definitely are raising some great little helpers. that would be so cute little kiddos to photograph or follow me around learning ugh i cannot wait.', 'speaker 1: i know. i saw this little toy camera the other day at the store and i can so picture your future little one carrying that around pretending to help you!', "speaker 2: the baby fever is running high today haha. please send some baby dust my way and i'll make sure in the mean time i am the best auntie to your little ones."], 'persona_list': ['Speaker 2 is not a fan of being in bed for a long time.', 'Speaker 2 has been sick and on bed rest for 5 months.', 'Speaker 2 has 3 kids.', 'Speaker 2 does not have much time for hobbies.', 'Speaker 2 enjoys taking pictures and sending them to others.', 'Speaker 1 enjoys photography and takes pictures of all sorts.', 'Speaker 1 spends a little too much money on photography.', 'Speaker 1 uses candles instead of electricity to save money.', "Speaker 1 is concerned about speaker 1's health and hopes they get better soon."]}
{'current': ['speaker 1: i just learned a new song on my violin and i tried some of that vegan chocolate you mentioned.', 'speaker 2: great, what did you think of the chocolate?', "speaker 1: it was pretty tasty, although i'm not sure i would replace my normal chocolate brand. how is your job going?", "speaker 2: the job is going ok, although it's a really busy time of year for us. what type of song did you learn?", "speaker 1: i hope your job isn't too stressful. i learnt a song by bach. i'm not that good at it, but i keep practising.", "speaker 2: oh it's just one of those annual things.  i enjoy listening to mozart do you like other classical music?", "speaker 1: mozart is nice. my favorite is debussy, he composed the song clair de lune. i'm going to learn that on violin next.", "speaker 2: gosh you're really talented and knowledgeable on the genre. does you ever get to play at the funerals?", "speaker 1: oh thanks, i do try. i don't play at funerals, as i'm too busy getting ready the body ready for the funeral.", 'speaker 2: ok, i was just thinking that it would be another string to your bow ( no pun intended). some families would like the extra personal touch.'], 'persona_list': ['Speaker 2 lives in georgia', 'Speaker 2 enjoys playing the violin', 'Speaker 2 likes to eat chocolate', 'Speaker 2 wants to get married and have kids', 'Speaker 2 works as a makeup artist in a funeral home', 'Speaker 1 is from pennsylvania', 'Speaker 1 loves to hike', 'Speaker 1 is a recent college graduate and started a job as an accountant', 'Speaker 1 is a vegan and only eats dairy-free chocolate', 'Speaker 1 wants to have a career before getting married and having kids', "Speaker 1 has knowledge of makeup work from her mother's fashion career."]}
{'current': ['speaker 1: did you get a chance to do any gymnastics?', "speaker 2: yes, i was cartwheeling and somersaulting in the park earlier. people were looking at me weird but i'm used to it by now. work on any interesting cars lately? ", "speaker 1: cool. i know how you love doing your gymnastic routines. yes i have been working on a corvette. after fixing it up, i will probably give it to my cousin. how's your work?", "speaker 2: nice, that's a great car. that's kind of you to do for your cousin, what a lucky person. work has been very fascinating, at the moment we're splicing pig dna and trying to combine it with elephant dna. ", 'speaker 1: ha! you are working on gene splicing? that sounds fascinating. any breakthrough yet? i am sure i will see your work on the news soon?', "speaker 2: well it's highly-classified research, think area 51 level. so far, we've managed to create elephant-pig hybrids that can live up to three days. at the moment we're trying to figure out a combination that gets us hybrids that live longer. ", "speaker 1: sounds like a science fiction but hey with today's technology sky is the limit right? so basically this experiment is proof-of-concept or are you doing this for a real application?", "speaker 2: we're trying to solve the hunger issue in africa, and we figure really fat pig-elephants should do the trick. that's a lot of bacon. ", 'speaker 1: true. if the hybrids can live longer than several days, that would truly revolutionize the farming industries. kudos to you!', "speaker 2: exactly. there's still a long way to go, but thank you. is fixing classic cars a hobby for you, or a job? ", "speaker 1: mostly a hobby. i grew up poor and did a lot of oddjobs. i made some money fixing people's cars and now i do it as a side hustle. ", "speaker 2: sorry to hear that you didn't have the greatest start but it's good that you've managed to turn that around. what's the coolest car you've ever worked on? "], 'persona_list': ['Speaker 2 is recovering from alcohol addiction', 'Speaker 2 has a difficult past (lived in a storage unit for 60 days)', 'Speaker 2 enjoys fixing old classic cars', 'Speaker 1 is a scientist', 'Speaker 1 has parents who are also scientists', 'Speaker 1 is into gymnastics', 'Speaker 1 is well-built', 'Speaker 1 does not drink alcohol due to its negative effects on the body.']}
{'current': ['speaker 1: have you watched any ted talks this week?', 'speaker 2: not in a few days. any good recommendations?', "speaker 1: i haven't really watched any lately.  i've been watching movies all day today.  did you make it to the zoo today?", 'speaker 2: no, its a bit snowy here. what movies are you watching?', "speaker 1: i'm watching wedding crashers right now.  i like older comedies!  the zoo in the snow might be cool!  i did that once!  it was cold but some of the animals that thrive in the cold were a lot more active!", "speaker 2: i'll have to check it out! what other older comedies do you enjoy?", "speaker 1: i like anything starring melissa mccarthy.  she's so funny!  the heat is my favorite!  what kind of movies do you like?", "speaker 2: i'll have to check out the heat. i do enjoy movies even though i don't love watching too much tv. i like movies with animals, but haven't found any good ones lately.", "speaker 1: sometimes i like watching documentaries on music.  i saw a cool one on folk metal recently.   you must have a lot of free time if you don't spend it watching tv!", 'speaker 2: i do! its definitely better for me, mentally. how is your cat doing?', "speaker 1: he's doing good.  always getting into things!  he likes to push everything off the counter!  i do think he enjoys our movie watching sundays though!", "speaker 2: how adorable! i'd love to get a cat. how long have you had your cat?"], 'persona_list': ['Speaker 2 enjoys watching movies on sundays.', 'Speaker 2 has a cat named folk metal tacos.', 'Speaker 2 talks in their sleep.', 'Speaker 2 prefers to spend time with animals.', 'Speaker 2 listens to folk metal music.', 'Speaker 1 exercises on sundays.', 'Speaker 1 goes for walks in the woods.', 'Speaker 1 enjoys watching ted talks.', 'Speaker 1 is interested in learning new things.', 'Speaker 1 prefers to spend time outdoors.']}
{'current': ['speaker 1: we play rock. we spent the last few hours rehearsing our new song.', "speaker 2: that's really cool! being in a band sounds fun but scary as well.", "speaker 1: scary? i suppose it can be when you first start playing in front of crowds. messing up during practice isn't too bad, but it's the last thing you want to do in front of a crowd of people.", 'speaker 2: i have social anxiety so the idea of being around all those people is pretty frightening for me.', "speaker 1: that'd definitely be an obstacle you'd have to overcome if  you ever wanted to play in a band. unless you're the singer it can be pretty easy to get engrossed in playing your instrument though ... sometimes i get so focused i forget the crowd is even there.", "speaker 2: that is an interesting way to look at it! i think i'll stick to working at my dad's appliance store for awhile unfortunately. it's not nearly as fun as a band.", "speaker 1: probably a bit more stable though. you always know when the next paycheck is coming in and how much it'll be.", "speaker 2: that's true but life gets boring without a little unpredictability. all i do is work and watch stuff on netflix.", "speaker 1: if you're feeling restless then maybe you should do something different. sometimes just cruising through life and hoping things will change on their own isn't enough.", "speaker 2: i wouldn't really know where to begin. i enjoy being alone and doing loner activities like running. i guess i could find more solo activities to enjoy.", "speaker 1: maybe you need to start a path of self discovery. i'm sure there's more you enjoy in life than just running and watching tv.", 'speaker 2: i suppose you are correct. maybe i should branch out and try to discover what i really like.'], 'persona_list': ['Speaker 2 is writing a new song for their band.', 'Speaker 2 has a band member who is also a best friend.', 'Speaker 2 enjoys watching comedies.', 'Speaker 2 has limited time for netflix.', 'Speaker 1 goes for runs while downloading movies.', "Speaker 1 works at their father's appliance store and is expected to take over or run it.", 'Speaker 1 is nervous around people and prefers to watch movies and run alone.', 'Speaker 1 enjoys watching foreign films and has a unique sense of humor.']}
{'current': ['speaker 1: what have you and your mother been up to lately?', 'speaker 2: we have been watching a lot of basketball recently. have you gotten any announcing gigs?', 'speaker 1: oh nice. i guess it is basketball season! i have not gotten any gigs yet. i am hoping that once the spring season starts, more opportunities will show up.', 'speaker 2: i hope that works out for you. do you have any plans to see a concert in the off season? i know you are busy with work and all/', "speaker 1: i am hoping to get to an avenged sevenfold concert. i haven't been able to see them in a year! what about you?", 'speaker 2: i have been wanting to see them too. do you know if they will be in town anytime soon?', "speaker 1: no. it looks like i might have to drive almost 2 hours away. it's definitely worth it. do you want to plan to go together?", 'speaker 2: yes lets plan to see them and next time i will drive us to see a day to remember. what is your favorite road trip snack?', "speaker 1: that's another a great band! i love honey bbq frito twists. what about you?", 'speaker 2: those are awesome! personally i am a fan of sour candy myself. would your fiance be interested in coming also?', 'speaker 1: oh my goodness have you tried the sour skittles?! those are so good! yes i think my fiance would love to come! do you have any friends that want to join?', 'speaker 2: usually i would bring my mom but i think she may be a little too old for a rock concert. i will ask my roommate if he would like to go. he is really into music and actually did the sound on my video game.'], 'persona_list': ['Speaker 2 has three jobs.', 'Speaker 2 listens to music (heavy rock and metal bands).', 'Speaker 2 is into avenged sevenfold.', 'Speaker 2 wants to become a baseball announcer.', 'Speaker 2 is in a relationship and recently proposed to their partner.', 'Speaker 1 just finished designing a video game.', 'Speaker 1 loves rock music (avenged sevenfold and a day to remember).', 'Speaker 1 enjoys going to baseball games with their mom (who is their best friend).', "Speaker 1 is excited about speaker 1's proposal to their partner."]}
{'current': ['speaker 1: my band just got invited to play at the coffee shop i work at!', 'speaker 2: oh wow, thats amazing! which coffee shop is it and what time? ill see if i can make it.', "speaker 1: the brew room. it's this saturday at 8pm. please do come! i'm worried no one will show.", 'speaker 2: ill bring the whole gang, matteo, marco, luca and juan! it will be amazing, i will make a big banner with your band name on it! haha', "speaker 1: don't take it too far! might embarrass our bassist. he's a little shy. ", 'speaker 2: ha, dont worry, he just needs a few beers down him. after youve finished your set. nothing worse than a drunk bassist.', "speaker 1: you nailed it. his problem is he can't find the line between, enough beers to ease up, and too many where his basslines turn to trash", 'speaker 2: ah, remember the last time at nye, he started wrestling the tree and jumped into the pool. bad times!', "speaker 1: terrible look. that's why he too scared to come on any hikes with me. he thinks all the trees want to take revenge. just kidding it's because he's lazy.", "speaker 2: haha! so funny that guy. i'd love to come hiking next time, just as long as you do it when im not at college. i know a great vegan cafe we can go to in death valley.", 'speaker 1: great vegan cafe in death valley? sounds like you happen to know where to find a cactus.', 'speaker 2: well, what else are we vegans going to eat if not cactus tea?'], 'persona_list': ['Speaker 2 loves to play jazz and piano in a band.', 'Speaker 2 is from algeria.', 'Speaker 2 works as a barista.', 'Speaker 2 enjoys going hiking and spending time outdoors on the weekends.', 'Speaker 2 speaks multiple languages, including french, english, and arabic.', 'Speaker 1 is doing well and is a student.', 'Speaker 1 plays soccer at school.', 'Speaker 1 is trying to catch up on game of thrones.', 'Speaker 1 is a vegan and looks for places to eat that serve vegan food.', 'Speaker 1 has a brother who has been to algeria.', 'Speaker 1 speaks only one language.']}
{'current': ['speaker 1: what do you teach online?', 'speaker 2: i teach math. it can be challenging because i have kids who distract me sometimes. they don\'t seem to get the whole "work at home" idea. lol', 'speaker 1: yeah i know the feeling. my kids are running around here all the time too, haha.', 'speaker 2: yeah. i just got through taking them to soccer practice. i thought their father was going to take them, but he fell asleep on the couch.', 'speaker 1: oh that sounds nice. it has still been much to cold where i am to have the kids play outside.', "speaker 2: i know what you mean. cold weather...there in the house all day with you. lol. i know you can't wait until it get's warm where you live.", "speaker 1: yeah i miss the warm weather. but there's nothing like a warm roaring fire on a cold night.", "speaker 2: yeah. so cozy. i love the crackling of the wood. i like to just sit there and meditate while looking at the fire. anyways, my dinner is almost done. i'm cooking a healthy meal with a salad.", 'speaker 1: oh nice. what kind of ingredients did you put in your salad?', "speaker 2: i'm having romaine salad with black and green olives, red onions, cherry tomatoes, blue cheese and little bits of ham.", 'speaker 1: that sounds very good and healthy indeed!', 'speaker 2: thank you! my kids actually enjoy it as well.'], 'persona_list': ['Speaker 2 is feeling great on a rainy evening.', 'Speaker 2 is seeking employment due to financial difficulties.', 'Speaker 2 resides in kansas.', 'Speaker 2 plans to return to school and move to a hot state.', "Speaker 2 prioritizes her children's well-being and growth.", 'Speaker 2 is grateful to be their mother.', 'Speaker 1 enjoys family time after cheerleading practice.', 'Speaker 1 works online and teaches online.', 'Speaker 1 has a degree.', 'Speaker 1 lives in a location that allows for outdoor activities like soccer.', 'Speaker 1 prioritizes healthy dinners and supports her children.', 'Speaker 1 is grateful to have a supportive family.']}
{'current': ["speaker 1: i was thinking about you living in new york. what kind of things do you like to do in new york. have you ever been to manhattan? i've never been to new york before. i bet it's a great place to live.", "speaker 2: i have been to manhattan. it's one of my favorite places in the world to go to. i love broadway.", 'speaker 1: yeah i hear they have the best theatre shows in the country. i bet it would be great to catch one. ', 'speaker 2: yes, definitely. my favorite show is wicked. it is fantastic.', "speaker 1: cool i'll be sure to keep an eye on it. i also hear they have the best pizza so i really want to try it when i go there. ", "speaker 2: yes the best pizza in the world by far. you have to try di fara pizza or john's in bleecker street. it's unbelievable.", 'speaker 1: my mouth is watering haha. have you ever swam in the hudson river?', "speaker 2: no, i'm not sure that is even legal to be honest.", 'speaker 1: oh i thought it was a popular thing for swimmers to do. where do you go swimming?', 'speaker 2: i usually swim at beaches nearby. hudson river water is dangerous because of the bacteria and uncleanliness of the water.', "speaker 1: gross.. thanks i didn't know. my only option is to swim in the ocean because the rivers and lakes are too small here. ", 'speaker 2: yeah that tends to be an issue around here too but we have a few beaches that are safe.'], 'persona_list': ['Speaker 2 loves the west coast.', 'Speaker 2 lives near the ocean.', 'Speaker 2 swims in the pacific every day.', 'Speaker 2 moved from virginia.', 'Speaker 2 has a mother who is a professor of environmental science.', 'Speaker 1 loves the color blue.', 'Speaker 1 enjoys swimming, but only in pools.', 'Speaker 1 is from upstate new york.', 'Speaker 1 has a mother who teaches cello lessons.', 'Speaker 1 enjoys the four seasons.']}
{'current': ['speaker 1: what is the hot fashion trend for girls in texas this year?', 'speaker 2: wrangler jeans becomes more trending now a days.you should also try it.', 'speaker 1: i should see if i can incorporate that into some of my designs.  i have an interview with the design school next week.', 'speaker 2: cool. all the best buddy. i know you do well.', 'speaker 1: thank you!  how are your girls doing?  how old are they?', 'speaker 2: they are doing fine. elder is 10 years old, second one is 7 and the last cutie is 5 years old. hey, you should help me to design them their outfits. ', "speaker 1: those sound like such fun ages!!  i would love to do that!  you'll have to let me know their sizes and some styles they are interested in and i'll start drawing some ideas up.", 'speaker 2: i will let you now about the size, you can prefer whatever style you want. ', 'speaker 1: ok sounds great that will be so much fun!  are your girls in any school activities or anything?', 'speaker 2: they are taking their online classes. so you can meet them whenever you want.', "speaker 1: awesome!  i'd love to do a video chat with all of you sometime and get to know them!", 'speaker 2: you would. i am expecting. they also will be enthusiastic if i told about you to them. i hope you guys get along.'], 'persona_list': ['Speaker 2 loves fashion since young.', 'Speaker 2 moved to ny to pursue fashion career.', 'Speaker 2 wants to be like coco chanel.', "Speaker 2 gets inspired to design new girls' styles when shopping.", 'Speaker 2 lives in ny and is from far away.', 'Speaker 1 has three daughters.', 'Speaker 1 daughters are into fashion.', 'Speaker 1 needs fabulous clothes for daughters.', 'Speaker 1 lives in texas and is from saudi arabia.', 'Speaker 1 enjoys wearing shorts or skirts in hot weather.', 'Speaker 1 would love an alexander mcqueen-style skirt for summer.', 'Speaker 1 has fun wearing different styles for different occasions.']}
{'current': ['speaker 1: i almost lost my sweet bird when i forgot she was on my shoulder and i opened the door to get the mail.', 'speaker 2: oh my! that would have been terrible! did she not fly away?', "speaker 1: she tried to, but i caught her in time. i'm so relieved. i would be so lost without her.", 'speaker 2: that must have been so scary. i know how much you love you animals. i am so glad that it ended well though!', 'speaker 1: me too, i definitely learnt my lesson. how is anna going?', "speaker 2: oh, my anna! she is adorable and getting so big! she certainly loves that i don't have a job right now!", 'speaker 1: dogs are so cute! how old is she now?', 'speaker 2: she is almost one! getting big fast!', 'speaker 1: wow, she has grown up so fast! does she like to play fetch?', 'speaker 2: she does, but she likes to just relax more. she and i have that in common, i guess! have you been to the doctor about your extra thumb?', "speaker 1: haha, relaxing is good. i saw a doctor about it a few years ago, and they said it was easier to leave it. i've grown up with it so it doesn't really bother me much.", 'speaker 2: well, i am glad to hear that. that must have been challenging though.'], 'persona_list': ['Speaker 2 has 3 thumbs.', 'Speaker 2 is curious about unique features.', 'Speaker 2 likes animals. (mentions a red bird)', 'Speaker 2 enjoys steak and potatoes.', 'Speaker 1 does not work and prefers to relax.', 'Speaker 1 is spoiled.', 'Speaker 1 has a golden retriever named anna.', 'Speaker 1 eats salads to maintain a healthy diet.', 'Speaker 1 whines a lot.']}
{'current': ['speaker 1: what kind of car do you drive?', 'speaker 2: i have a maserati.  i really like driving fast to get out my anger.  i do like to hike as well, though.  where do you hike?', 'speaker 1: there are plenty of hiking trails near where i live. i just pick a new one every weekend and go exploring. what about you?', 'speaker 2: i use an app and try to find trails that are a distance away, so i can have a nice drive, too.  have you seen anything really cool on your hikes?', "speaker 1: i've seen some amazing wildlife. do you own more than one car or just the maserati? is that what you take when you go hiking?", 'speaker 2: i have an suv, too.  i switch between the two, depending on how i feel.  do you own a car?', 'speaker 1: i just have a boring sedan. nothing too special but it gets the job done. i hope to get an suv soon though to give me more off roading options. doo you recommend one in particular?', "speaker 2: actually, it's my wife who chose the suv.  she did all the research and we ended up with a land rover.  i like it a lot, especially when we want to take our dog out with us. he doesn't fit in the maserati. ", 'speaker 1: what type of dog do you guys have? and how long have you been married?', "speaker 2: we've been married for 10 years.  moxie is a 90lb german shepherd/airedale mix.  how about you? married? kids? pets?", "speaker 1: i've been married for almost 8 years. 2 kids ... no pets. but my daughter would love to get a kitten! your dog is huge!! how long have you had him?", "speaker 2: we've had him since he was a puppy, so 14 years now.  we used to have four cats, but now we just have one. how old are your kids?"], 'persona_list': ['Speaker 2 is outdoorsy.', 'Speaker 2 goes hiking.', 'Speaker 2 gets their nails done every week.', 'Speaker 1 is angry often.', 'Speaker 1 has a fast temper.', 'Speaker 1 is competitive in volleyball.', 'Speaker 1 dislikes losing.']}
{'current': ['speaker 1: how was studying social sciences with your master?', "speaker 2: it is going well, it takes a lot of time, so i don't get to cook as much as i like to.  is your lake frozen over?", "speaker 1: it is right now. i've been skating almost every day and playing hockey with my son. have you enjoyed any pizza lately in these winter months?", 'speaker 2: that sounds like so much fun! pizza is a great comfort food for the winter.  how is your business going?', "speaker 1: it's actually been really steady, vintage furniture is making a comeback and people want theirs redone to display. what is your favourite pizza chain?", 'speaker 2: my favorite pizza is from papa murphys, i like being able to choose my toppings and then bake it at home!  i was at an antique store the other day and saw lots of great redone pieces.  if i go back i will send you some pictures for inspiration.', "speaker 1: that would be fantastic! i really like the 60's era style furniture we see in the tv show mad men. papa murphy's sounds delicious... my favourite pizza is dominos right now. ", "speaker 2: ok, i'm planning on going next week i'll take some pictures", 'speaker 1: perfect. is there a sushi place near the antique store?', "speaker 2: yes thats why i went to there, saturday is my sushi day so i'll go next week.", 'speaker 1: that sounds like an incredible day. how many rolls do you usually order?', "speaker 2: i only order two and usually can't finish those? do you like sushi?"], 'persona_list': ['Speaker 2 likes eating big sausages.', 'Speaker 2 lives near a lake full of fish for sushi.', 'Speaker 2 has a husband who loves eating her fish.', 'Speaker 1 has a favorite food of pizza and sushi.', 'Speaker 1 is a student of the social sciences.', 'Speaker 1 has a hobby of cooking.', 'Speaker 1 is forgetful.']}
{'current': ['speaker 1: i am so sad, my cat got sick!', "speaker 2: oh, i am so sorry to hear that, stacy. i hope it gets well soon. and don't be sad. animals can sense it. let's just hope for the best. ", 'speaker 1: i am cuddling it until it gets better. do you have any pets?', "speaker 2: aww. that's sweet. i don't have a pet yet but i am hoping to get a cat soon. they are so adorable.", 'speaker 1: yes my cat is called roley. will it just be your cat or do you have a boyfriend?', "speaker 2: that's a lovely name for a cat. yes, i live with my boyfriend and he likes cats too so, we are looking forward to getting one. what's your dog's name?", 'speaker 1: that is nice, what is his name? my dog is called barney and he is 10 years old. my dad said we can get another animal soon too. i like to walk them.', "speaker 2: so, you and barney are the same age! that's wonderful! my boyfriend's name is kay.", 'speaker 1: yes, my parents got me and him at the same time. that is a cool name. what do you like to do with him?', "speaker 2: that's great! so, you must be very close to barney. and thanks! he's still attending college, finishing his masters and is mostly occupied with work and stuff so, we usually go out over the weekend. there are some days when i don't even get a chance to see him or talk to him which is sad.", "speaker 1: yeah, he follows me everywhere. that is sad, i get sad when i don't get to see my friends. but i get to see them at school so it's ok.", "speaker 2: it's good to see friends at school else school will be so boring. anyway, i'll catch up with you again soon. have a good night, stacy."], 'persona_list': ['Speaker 2 is 10 years old.', 'Speaker 2 loves pets.', 'Speaker 2 enjoys walking her dog and playing with her cat.', 'Speaker 2 likes good weather for dog walking.', 'Speaker 1 is 26 years old.', 'Speaker 1 is in good health.', 'Speaker 1 enjoys running every day.', 'Speaker 1 is a fan of football.', 'Speaker 1 was a kicker in college.', 'Speaker 1 enjoys watching sports on tv.']}
{'current': ['speaker 1: how has work been for you?', 'speaker 2: we have been kind of slow lately. it gets boring and you can only clean stuff so much. ', "speaker 1: speaker 1: that sounds awful. i hope that business picks up. my job as a bank teller isn't much better; we haven't had anyone come in since the recession hit.", "speaker 2: oh no. will they start cutting hours or firing people if it doesn't pick up a little bit? ", 'speaker 1: i think they might, i hope i keep my job. are you in danger of losing your job?', "speaker 2: i might. i could transfer to another, busier location but it would be farther to walk. i don't mind a longer trip unless it is raining or snowing, then it can get ugly. ", "speaker 1: yeah, i imagine the weather can take a turn for the worse in new york. the weather is more stable here in oklahoma, but we've got our own problems here in tornado alley. have you ever seen a tornado in person?", 'speaker 2: no, thank god. i bet you have seen some more up close that you liked, right? ', "speaker 1: yeah, they're pretty scary. have you seen any major snowstorms or blizzards up there in new york?", "speaker 2: yeah i have been in some bad ones. my work doesn't shut down unless it really really has to though. one time i had to hitch a ride to work with a snowplow driver because the streets were so bad. ", "speaker 1: that's both fortuitous and terrible! what a crazy day that must have been. i've only lived in oklahoma my whole life, so i haven't seen too much snow. but i'm glad that i have a car to get me around; how do you normally manage without one?", "speaker 2: new york is a great city for walking. i can ride the subway if i really need to but being a woman riding alone isn't really safe. walking is better. "], 'persona_list': ['Speaker 2 is drinking their fifth cup of tea', 'Speaker 2 has a preference for walking', 'Speaker 2 lives in a place with good weather for walking', 'Speaker 2 has a positive view of new york city as a place for walking', 'Speaker 1 works at a fast food restaurant', 'Speaker 1 walks home every night (3 miles)', 'Speaker 1 does not currently own a car', 'Speaker 1 enjoys walking', 'Speaker 1 lives in new york city', 'Speaker 1 has a preference for the color of their subway (implied by the question)']}
{'current': ['speaker 1: i noticed my dog has some gray hair now too!', "speaker 2: wow. really? i wonder if it's because of age or something else. when did you notice them first?", 'speaker 1: just recently. i had to give him a bath and while i was drying him off i noticed that he has a few grey hairs in his coat. he is getting a little older now since he is 10.', 'speaker 2: oh yeah, probably because of age then. my dog is nearing the age of 13 now. pretty old fellow. and how are your children?', "speaker 1: my children are good. they are not old at all like the dog, so they have a lot of energy. only one still lives with me though, so i don't often see the older two. how old are your nieces and nephews? do you get to see them often.", 'speaker 2: oh how old is your youngest? and my nieces and nephews are small too so they love to play games whenever i see them. my sister lives pretty close by so i see them every other weekend. ', 'speaker 1: oh, that is nice that you see them so often. my youngest is 16. he is just learning to drive. what kind of games do you play with them?', "speaker 2: wow, i bet driving makes for a lot of fun quality time together. with my nieces and nephews, we typically play hide and seek or treasure hunt. i end up so exhausted but it's great so i can't complain.", "speaker 1: it is nice to see him becoming more independent, but i must admit it is stressful. it's not really fun at all. i guess i can't help but worry. i used to love to play hide a seek when i was a kid. i bet they tire you out after working a long day at a retail job too!", "speaker 2: yes, i completely understand. children growing up definitely makes one worry. and yes, it is tiring but also a stress reliever from my job so it's a little bit of balance i suppose. ", 'speaker 1: oh that is nice that it relieves stress. to relieve stress i like to bake and eat cupcakes. sometimes i give my dog a little if it is not chocolate.', "speaker 2: i love cupcakes! i bet working at the grocery helps with you baking hobby since i'm sure you get discounts on the ingredients. what kind is your favorite to make?"], 'persona_list': ['Speaker 2 enjoys eating cupcakes.', 'Speaker 2 works at a local grocery store.', 'Speaker 2 likes to read to wind down.', 'Speaker 2 has a pet yorkie named blue.', 'Speaker 2 is married with three children.', 'Speaker 1 is winding down from a day at work.', 'Speaker 1 works at a local department store.', 'Speaker 1 likes to read and play with her dog.', 'Speaker 1 has a pet dog but no children.', 'Speaker 1 is single.']}
{'current': ['speaker 1: how are you feeling? are you still sick? ', "speaker 2: i'm better now thanks. have you had any luck in the job hunt?", "speaker 1: that's great, i am glad you made a full recovery. i am still looking. i don't want to just settle for anything. i am trying to find something that i think i will really enjoy.", 'speaker 2: yeah, important to find the right fit. are you looking for something in particular?', 'speaker 1: i agree. i am not limiting myself to a certain field. i am trying to be open to anything that will utilize my skills. i did see a posting from a local pro shop that has an archery range and an opening for an instructor. i think i would like that.', 'speaker 2: are you going to apply for it, maybe?', 'speaker 1: i actually have to go in person and show some of my skills. i have an appointment next week. it really is a job just looking for a job, with all the time and effort that you put in.', "speaker 2: that's good you have put yourself out there. good luck. it really is tough looking for a job", 'speaker 1: thank you! it really has been difficult lately, there just seems to be less opportunities out there. i am optimistic though!', 'speaker 2: it is tough, i know myself try to keep applying, you will get something. do you have any hunting planned for the weekend?', 'speaker 1: i will probably just browse online and see if i come across any new interesting postings, and wait for my interview next week. i do appreciate your encouragement! do you have any plans for the weekend? are you taking the dogs out anywhere?', "speaker 2: sometimes it is nice to surf the web. yeah, i'm taking the dogs to the beach on saturday."], 'persona_list': ['Speaker 2 likes remodeling homes', "Speaker 2 enjoys hunting but doesn't actually kill anything", 'Speaker 2 is on instagram and likes to pose and use filters', 'Speaker 2 might start looking for a wife', 'Speaker 1 is stuck in bed all day due to sickness', 'Speaker 1 works from home', 'Speaker 1 has dogs that visit her in bed', 'Speaker 1 loves playing computer games', 'Speaker 1 is always on social media, especially instagram', 'Speaker 1 might be looking for a wife who likes hunting']}
{'current': ['speaker 1: i heard one of my favorite 80s song today.', 'speaker 2: ha, you and your 80s music.  give me a good country song any day!', 'speaker 1: hey dont knock it until you try it! i do love some johny cash though!', "speaker 2: alright, well you have me there.  do you get much requests for 80s music in the wedding sector these days?  bringing in the 'something old' as it were?", 'speaker 1: oh, you know it! everyone loves to go out and make a fool out of themselves on the dance floor. what kind of business do you work in? ', 'speaker 2: ah nothing half so exciting; just the old grind of the business sector.  stocks, trades, numbers.  but i guess we all have to make a living!', 'speaker 1: that is true! my favorite season is fall, as well. i love to watch all of the leaves turn colors. the pretty oranges, yellows, and reds always make me happy. plus, you get halloween, and i do love ghost hunting!', "speaker 2: oh that's right, i remember you mentioning your ghost interest in our prior conversation.  can't say i know too much about the ins and outs of hunting them though!  seems a dangerous game to play.  have you... caught? any ghosts?", 'speaker 1: no, they are actually surprisingly hard to catch. you would think i could get a cool machine like on ghost busters, but noooo. most of the time i just look dumb yelling in an empty forest or cemetary. now that i think about it, maybe i should get a new hobby. have you ever seen any ghosts? ', "speaker 2: well to be honest i would be concerned if they were too easy to catch.  i honestly haven't given it much thought; that's the trouble when work is your everything.  not much time to contemplate the deep stuff, much less go out on a date!  can't say i've actually seen any thought, although there's always stuff you can't explain.", "speaker 1: i forgot you said earlier you hadn't kissed a girl. how long has it been since you went on a date? do y ou live in a large city where you have options or in the country where pretty girls and few and far between?", "speaker 2: oh man, i can't even remember.  over a year at least!  you'd think in nyc there'd be more of a dating scene, but everyone i know is work related, and the boss is pretty big on overtime.  and hey, don't go spreading around that i haven't kissed a girl!  need to maintain what little street cred i have in that department."], 'persona_list': ['Speaker 2 has a fascination with ghosts.', 'Speaker 2 had a childhood dream to be an architect.', 'Speaker 2 currently plans weddings.', 'Speaker 2 loves 80s music.', 'Speaker 1 is in business.', 'Speaker 1 is surprised by where they are in life.', 'Speaker 1 loves country music.', 'Speaker 1 relates orange to fall, their favorite season.', 'Speaker 1 is a winner (mentioned in the dialogue).']}
{'current': ["speaker 1: you'll never guess what crazy thing happened at the gym today!", 'speaker 2: please tell me about it', 'speaker 1: i was running on the treadmill and i looked over and tom brady was on the treadmill next to me!', "speaker 2: no way! the tom brady. i wonder why he's in town", "speaker 1: i'm not sure. my only thought is that maybe he is filming something while he is here. how is your off season going?", "speaker 2: i'm so happy to get a break. i still need to go to training sessions with the coach but they aren't nearly as intense. i think i've put on some weight though since i've been relaxing too much!", 'speaker 1: well, you have plenty of time to get back into playing shape. when do practices start again?', "speaker 2: they don't start for another 6 or 7 weeks yet. i was thinking about joining a gym in the meantime. is your gym taking new clients?", "speaker 1: they are. it's  big gym, so they are always looking for new members. you should come check it out!", 'speaker 2: i think i will. i know you are there a lot so i should come then and we can catch up. what days do you train?', 'speaker 1: i usually do m-th and then saturday. i like to have a couple off days a week. how about you?', 'speaker 2: i think ill just stick to training on weekdays. i usually like to train in the mornings.'], 'persona_list': ['Speaker 2 is a travel agent.', 'Speaker 2 enjoys staying fit and goes to the gym 5 times a week.', 'Speaker 2 runs a business that is owned by their parents.', 'Speaker 2 is interested in running their own business in the future.', 'Speaker 1 is a professional football player for the baltimore ravens.', 'Speaker 1 is physically fit and gets exercise beyond just going to the gym.', 'Speaker 1 has a goal to open a sports store after retiring from professional football.', 'Speaker 1 is focused on their athletic career for now and has a busy schedule.', 'Speaker 1 mentions wanting to open a bar in the future.']}
{'current': ["speaker 1: i have to see a physiotherapist to assess whether i'll be able to walk again. ", 'speaker 2: wow that must be nerve racking. does the doctor have a good reputation?', 'speaker 1: i am better now. yes, my doctor is very caring and with all her support i am here. why you not like your job? ', "speaker 2: my job is quite boring because i have to do the same thing over and over again. it's quite monotonous. i prefer work that is more fun", 'speaker 1: i can understand! do you have any other job in your mind which you want to do like related to craft or something?', "speaker 2: yes if i could i would be a painter but i don't think i would make enough money to support my children", 'speaker 1: you can start painting with your current job. when your business will do well, you can quit your job. you will get a fair idea how much you can earn by your painting. you might become millionaire. .', "speaker 2: wow, that's a good idea! do you enjoy painting?", 'speaker 1: yes i love to do, but i am not a great artist like you. i like to do paint by number. i make me calm when i am in pain. ', "speaker 2: oh i love that too. i'm glad it's able to help you relax. and you can paint pictures of your pets too!", "speaker 1: that's a great idea. i would love to do that. how's your kids doing? do they love painting?", 'speaker 2: yep! they love painting a little too much. my youngest painted a picture on the walls!'], 'persona_list': ['Speaker 2 is glad to have someone to play with.', 'Speaker 2 is lonely and wants companionship.', "Speaker 2 has a cat and fish that don't want to play with them.", 'Speaker 2 had an accident that left them stuck in a bed.', 'Speaker 2 works from home.', 'Speaker 1 has five children that are crazy and keep them busy.', 'Speaker 1 works with market research and makes annoying phone calls for surveys.', 'Speaker 1 is craftsy but is a perfectionist, which makes it hard to enjoy their hobby.', "Speaker 1 has a job that they don't find fun."]}
{'current': ['speaker 1: my 18 month old just started talking. it is the cutest thing hear them talk.', 'speaker 2: what was her first word?', 'speaker 1: her first word was pizza. how was your 25th birthday? what did you do?', 'speaker 2: it was great! i just had a paint and wine night with some friends, it was so much fun!', "speaker 1: that's awesome, i'd love to try a paint night sometime. were you into amateur wrestling or professional wrestling?", 'speaker 2: amateur, although i had always loved professional as well. have you read any good books lately?', "speaker 1: i recently read american sniper by chris kyle. some of the details are terrifying. i hope you don't have to be deployed any time soon. ", "speaker 2: i hope not either. it's always nice to have time at home, and being far away from my son is very hard.", "speaker 1: what is your son's name? does he play any sports? he must have so many friends at school. ", 'speaker 2: ashton, and he plays football and soccer! sports are his favorite thing ever! i love watching all of his games.', "speaker 1: that's a great name! it's good to hear he plays a few sports. it is very important to stay active and healthy, it helps grow confidence i've found. ", 'speaker 2: that is so true. when your little one grows up, are you going to encourage her to play a sport?'], 'persona_list': ['Speaker 2 loves reading (subject is related to the object)', 'Speaker 2 is bilingual (subject is related to the object)', 'Speaker 2 has lots of free time (subject is related to the object)', 'Speaker 2 dropped out of high school (subject is related to the object)', 'Speaker 2 likes red (subject is related to the object)', 'Speaker 2 is a single mom (subject is related to the object)', 'Speaker 1 is doing great (subject is related to the object)', 'Speaker 1 likes to read to her son (subject is related to the object)', 'Speaker 1 is military (subject is related to the object)', 'Speaker 1 is good at wrestling (subject is related to the object)', 'Speaker 1 loves to paint (subject is related to the object)', 'Speaker 1 is 25 years old (subject is related to the object)']}
{'current': ["speaker 1: all done with working on the farm, how's the job search going for your boyfriend?", "speaker 2: the job search is going great.... he has had some promising leads.  i just wish people would see how great he is and offer him what he is worth.  how's life on the farm?", 'speaker 1: like on the farm is good, the chickens are having a rough time with the cold and theyve been fighting. ', "speaker 2: oh i bet.  it can't be cheap keeping everything heated.  will they still lay eggs in the cold?", 'speaker 1: yes they still lay in the cold...chickens lay according to daylight, in the winter laying slows but some will still continue to lay an egg a day.  does your boyfriend have any experience working on the farm?', "speaker 2: no, he doesn't... but that doesn't mean he won't put on his work boots and learn.  do you need an extra hand?", "speaker 1: yes, my wife used to help but shes put on a lot weight lately and can't help anymore...i've been looking for someone.  would he be interested?", 'speaker 2: even if he says no, i am going to insist that he does help... he would benefit from the extra skills.  what do you need help with?', 'speaker 1: i need someone to sheer the sheep and birth the cows.  its messy but satisfying work.', "speaker 2: oh heck yeah... if he doesn't want to do it, i sure will!  what are the hours?", 'speaker 1: i need someone bright and early, 6am to 3pm...glad to have you and your boyfriend on board!', 'speaker 2: you got it... we will be there!  bright and early... oh... about the pay??'], 'persona_list': ['Speaker 2 is tired from farmwork.', 'Speaker 2 has a beard that hurts.', 'Speaker 2 drives a truck into his house.', 'Speaker 2 has a wife who is overweight.', 'Speaker 2 is fit from working on the farm.', 'Speaker 2 is older (41).', 'Speaker 1 is tired from work.', 'Speaker 1 has to walk up 6 flights of stairs.', 'Speaker 1 is looking for a job for her boyfriend.', 'Speaker 1 values keeping in shape and exercising.', 'Speaker 1 is younger (25).', 'Speaker 1 lives in an apartment with limited space.']}
{'current': ["speaker 1: i put my cat outside so it won't bother you.", "speaker 2: oh okay, thanks for the consideration. somehow i'm scared of cat and i don't why", "speaker 1: so, i gather that you do not like any animal at all. why is that? just curious. if you don't mind me asking.", "speaker 2: yea, ever since i witnessed a pitbull kill my neigbour, i'm just scared of dogs, but cat i do not like them naturally for some reason, they scare me.", 'speaker 1: oh, i am sorry to hear about that. i understand. such traumatised memories can scar you for life. i hope you feel better about it over time.', "speaker 2: thanks, i hope so, anytime i see a dog i'm reminded of the incident, i'm not against people that have it though just wished i never witnessed the killing", 'speaker 1: i feel you. anyway, how has the week been so far? ', "speaker 2: oh that, it hasn't been bad. at least i have been able to come back home on time for dinner with my family, how about yours ?", "speaker 1: the same. not bad. i have been spending some quality time with leo, my cat. he's happy to see me around more often than usual.", 'speaker 2: i bet, i wish i can have that connection with animals again, anyways like you stated maybe time will help me forget what happened . happy to hear that you spend quality time with your cat', 'speaker 1: i hope the same for you. and thanks! do you have any plans for the weekend?', 'speaker 2: no problem, yea i have nothing much planned i guess i will just chill with my family this weekend for a change'], 'persona_list': ['Speaker 2 enjoys fine dining.', 'Speaker 2 has a big beard and viking outfit.', 'Speaker 2 might attend the renaissance fair.', 'Speaker 1 enjoys pizza and checking out new concept cars.', 'Speaker 1 is creative and sews different costumes for each day of the renaissance fair.', 'Speaker 1 prefers purring from cars instead of animals.', 'Speaker 1 is not a fan of animals, especially cats, dogs, and birds.']}
{'current': ["speaker 1: how's the production of your movie going? ", "speaker 2: it's going great! i'm making a new version of my favorite movie, twister", "speaker 1: oh no way, i didn't know they were making a sequel. ", "speaker 2: it's a reboot! can't wait for the premiere! so, how are your pet chickens?", "speaker 1: they're pretty good. i like them because they are simple and remind me to enjoy the little things.", "speaker 2: that's great, it's always the little things that makes life worth living! looking at the little things also inspire my paintings! ", 'speaker 1: yeah i thought it must be such a different artistic change to go from painting to being an extra!', 'speaker 2: oh it is! are you still painting?', 'speaker 1: yeah i recently made a few of my chickens, some of them are serious and some are funny.', "speaker 2: that's awesome, how many chickens do you have again?"], 'persona_list': ['Speaker 2 loves eggs for breakfast', 'Speaker 2 is born to paint and create art', 'Speaker 2 has chickens and birds as pets', 'Speaker 2 enjoys walking on the beach', 'Speaker 1 loves creating art', 'Speaker 1 is known as a painter', 'Speaker 1 has twin brothers', 'Speaker 1 is talented in singing and has won several competitions', 'Speaker 1 is working as an extra in a major motion picture', 'Speaker 1 enjoys watching movies, especially "baby driver"']}
{'current': ['speaker 1: guess what i would like to do on mars and the moon.', 'speaker 2: knowing you i bet you would like to play atari haha', 'speaker 1: haha! almost. i would love to teach a class, remotely of course, from mars. how cool would that be?', 'speaker 2: that would be awesome! what would you like to teach them about?', "speaker 1: space, obviously! i could perform experiments and show them what happens when you don't have gravity to deal with. they would have to be in high school or higher so that the concepts wouldn't overwhelm them. ", "speaker 2: there is gravity on mars! you should know this stuff, your a scientist! maybe teaching wouldn't be your strong point hahaha", "speaker 1: yes, there's gravity on mars, but it's not the same as on earth. i would have students do the same experiments as me, then we could see how the results differ. i might be able to inspire a couple of kids to go into the space program. speaking of teaching, how are your classes going? ", "speaker 2: ah now i get you! we'll if you ever get a second ticket to mars i'll be your plus one!  they are going quite well so far, i've even started doing some placement work", "speaker 1: my plus one ... you got it. i'm glad the classes are going well. what grade(s) is/are your placement work in?", "speaker 2: i've been placed in pre-schooling which to be honest is exactly what i wanted. i think it's the most important time to get children interested in education even those that don't have developmental disorders", "speaker 1: pre-school! wow!  it takes a special person to take on that role. i don't think i could do it. i'm glad you're passionate about it.  yes, i agree about reaching kids at a young age. it's important to get them off on the right foot, education-wise. i would imagine that it is difficult to diagnose education issues at such a young age. is it?", "speaker 2: we are learning how difficult diagnosis is in my classes but luckily we don't have to deal with that in placement as anyone in the school has been previously diagnosed. this can be quite demanding though as it means that many of the children in the school have quite severe disorders as milder disorders tend to appear later"], 'persona_list': ['Speaker 2 enjoys being a scientist.', 'Speaker 2 likes living alone and playing guitar.', "Speaker 2 plays video games and has two master's degrees.", 'Speaker 2 is helping to colonize mars and the moon.', 'Speaker 2 values free time and enjoys playing guitar.', 'Speaker 1 has a fun and active lifestyle, kayaking on the weekends.', 'Speaker 1 has a bad habit of chewing nails.', 'Speaker 1 is studying to be a teacher for special education.', 'Speaker 1 is interested in visiting mars and learning from speaker 1.', 'Speaker 1 values education and helping others.', "Speaker 2 subject: enjoys being a scientist, plays video games, values free time, and has two master's degrees.", 'Speaker 2 object: living alone, playing guitar, atari, and mars/moon colonization.', 'Speaker 1 subject: has a fun and active lifestyle, values education, and is interested in visiting mars.', 'Speaker 1 object: kayaking, chewing nails, studying special education, and helping others.']}
{'current': ['speaker 1: i got to go on a 3 mile run earlier today. it was nice.', 'speaker 2: wow you can squeeze a run in anytime, i wish i was into like you! do you monitor your health stat with your phone while your run?', "speaker 1: i'm not a morning person but i try to wake up early when i can motivate myself to do so, i always feel better later!  and yeah, i use it to keep track of my steps, calories and water intake, all of that.  do you like to monitor your health stats on your phone?  do you feel android is better for that?", "speaker 2: thats a really good habit, i may try it. i don't monitor my stats right now, but i am thinking about doing it. yeah i find the new apple iphones to be a expensive, i might get an android.", "speaker 1: you should!  it's hard but so rewarding!  they are soooo expensive, you're right about that!  i used to have an android and really liked it, but the iphones do have some things i really like, like airdrop and facetime!  what are you most excited for on an android?", 'speaker 2: yes, the no facetime may be annoying because many of my friends and family will still have iphones. for the android i find there are a lot of cheaper educational apps for my son to work on pre-school stuff.', "speaker 1: yeah, there are similar features on both devices but everyone you know has to have the same system for it all to work!  :(  oh, that's a very good point.  i use a lot of apps for school too!  how old is your son?", "speaker 2: my son is 4 now, he is excited to go to kindergarten and get the school bus. i can't believe the time has come! i just like reading to him, but he will be gone!", "speaker 1: i'm sure you will still be able to find time to read to him, that's so great he loves it!  english is my favorite subject in school!  does he have a favorite book?", 'speaker 2: yes he loves "give a mouse a cookie", i\'ve read it a billion times, that pesky mouse. what school level are you in? ', "speaker 1: i remember you mentioning that one!  haha i remember reading that when i was a kid.  have you read the other ones in the series?  i'm a senior in high school!", 'speaker 2: yeah i have read, "give the mouse some chocolate", "give the mouse some pizza", and most recently "give the mouse some credit". so your almost done high school! any idea what\'s next for you?'], 'persona_list': ['Speaker 2 is tall', 'Speaker 2 likes running', 'Speaker 2 is staunchly pro-iphone', 'Speaker 2 enjoys reading bedtime stories to children', 'Speaker 2 has a favorite bedtime story ("if you give a mouse a cookie")', 'Speaker 2 values spending time with children', 'Speaker 1 is looking for advice on whether to get an iphone or an android', 'Speaker 1 has an iphone 7 but is considering getting a samsung 8', 'Speaker 1 is a reader and enjoys reading bedtime stories to their children', 'Speaker 1 values spending time with their children and drinking hot chocolate together', 'Speaker 1 had a father who worked long hours and they missed him.']}
{'current': ['speaker 1: how are your brothers and sisters doing?', 'speaker 2: they are doing great. my sister got in trouble though because she let me listen to this rapper named lil tjay, have you heard of him?', 'speaker 1: oh yeah, lil tjay is my jam. he goes hard in the paint. did you like listening to him?', 'speaker 2: yes, i wish my mom let me listen to him.', "speaker 1: you can do it behind her back she wont know if you wear headphones. have you listened to lil tjay's new song, big clappers?", 'speaker 2: she took my phone from me since i let my sister let me listen but once i get it back i will have to listen to it. do you have any siblings?', "speaker 1: nope. i'm an only child. if you like lil tjay you should check out lil wayne when you get your phone back. his new song mahogany is pretty good. i think you'll like it.", 'speaker 2: i will definitely check it out. i would hate being an only child. ', "speaker 1: yeah it's a bit lonely at times. but that's why i listen to a lot of music, it makes me feel less lonely. also i'm glad you became my friend, i don't have many friends.", "speaker 2: do you ever read comic books? i go to comic readings and parties, that's how i make my friends.", "speaker 1: i've watched comic book movies. like avengers, thor, hulk, etc. but i've never read them. what comic books do you read?", "speaker 2: i read a lot of batman, he's my favorite. marvel is good tho. "], 'persona_list': ['Speaker 2 likes rap music', 'Speaker 2 is old (mentions "when you get old")', 'Speaker 2 likes sleeping', 'Speaker 2 is interested in ergonomic keyboards and chairs', 'Speaker 1 is 8 years old', 'Speaker 1 loves reading comic books', 'Speaker 1 wants to be superman when they grow up', 'Speaker 1 is curious and wants to learn more "big words"', 'Speaker 1 has lots of brothers and sisters', 'Speaker 1 is curious about where babies come from']}
{'current': ['speaker 1: i cooked the best dinner last night.', 'speaker 2: what is it? can i try next time? ', "speaker 1: i made shrimp alfredo with a home made alfredo sauce.  i know you can't eat seafood, so if i make it for you i would switch out the shrimp for chicken", 'speaker 2: that sounds great, i can bring the best chocolate around next time and we play some video games ', 'speaker 1: sounds good, which video games are you playing these days?', "speaker 2: i was reading the book cyberpunk and then the game was out last month. that's what i mostly into recently. what about you? what's on your gaming chart?", 'speaker 1: i mostly play on my pc, however, i heard about a game called rocket league that i have been trying to play, its really hard though.', "speaker 2: i haven't bought it yet. maybe we should have a go after our saturday chicken dinner!", 'speaker 1: yes, bring your controller and i can load it up.  maybe you can help me figure out how to win!', 'speaker 2: definitely! shall we meet at 5 pm then we can do the food shop as well? ', 'speaker 1: 5 works for me, we can meet at my house and then run to the store real quick!', "speaker 2: that sound's perfect,  i will finish the book reading club by 4:30 and keep you posted!        "], 'persona_list': ['Speaker 2 is nerdy.', 'Speaker 2 enjoys baking and cooking.', 'Speaker 2 is a stem major.', 'Speaker 2 loves to measure things accurately.', 'Speaker 2 is a gamer.', 'Speaker 2 has a sense of humor (likes to make puns).', 'Speaker 1 likes nerdy people.', 'Speaker 1 is allergic to seafood.', 'Speaker 1 loves chocolate.', 'Speaker 1 drinks hot chocolate.', 'Speaker 1 enjoys spending time with family.', 'Speaker 1 reads a lot.']}
{'current': ['speaker 1: what did you find the most challenging about getting into motocross, are you scared while riding?', 'speaker 2: getting into it the first time i was driven by passion only and i soon learned you need big sponsors to compete and maintain competing at the top level. i am not scared though...', "speaker 1: that sounds really amazing. it's such an interesting sport that i would love to learn more about. how did you first get into it?", 'speaker 2: a friend of a friend actually introduced me to it, so now i do it part time when i get off from working at a construction site. is motocross something that would interest you?', "speaker 1: well, it's a big adventure and i don't think i do too well with unknowns in reality. but the idea of it really does interest me.", 'speaker 2: we can schedule you see me racing then baby steps from their if its something that you might like?', "speaker 1: really! i would love that opportunity! let's do it. do i need to bring anything with me? or will you supply all of the equipment?", 'speaker 2: everything will be supplied, you just come over. i will text you once i get a race date. anyway how are your parents?', "speaker 1: that sounds great! thank you. my parents are doing well. they just sold their business so they're really happy that they get more time to just relax now.", "speaker 2: that's cool, how did it feel like having to work with them in the same science research  facility?", "speaker 1: it was extra stressful. always having to live up to someone else's ideal. but in the end it did work out nicely.", 'speaker 2: i bet they were really proud of you. is working on cancer research something personal to you?'], 'persona_list': ['Speaker 2 works at a scientific research facility', 'Speaker 2 does cancer research', 'Speaker 2 is pessimistic about finding a cure for cancer', 'Speaker 2 has parents who also work at the research facility', 'Speaker 1 is a construction worker', 'Speaker 1 is optimistic about finding a cure for cancer', 'Speaker 1 enjoys motocross', 'Speaker 1 is enthusiastic about sports']}
{'current': ['speaker 1: i forgot to ask, what is your favorite beatles song?  mine is yesterday.', 'speaker 2: my favorite is something. the drums and vocals sound so nice to me i love it. i wish i could sing as good haha.', 'speaker 1: oh i love that song too! did things calm down with the family?', "speaker 2: yeah things are better now. it was mostly my in-laws causing problems but we have separated ourselves now so there aren't any issues. ", "speaker 1: i'm so glad. i hear you on the in-laws. i try to be around mine as little as possible! i am making beans and rice right now and blasting some beetles!  ", 'speaker 2: nice! are there any new dances you are learning?', 'speaker 1: right now i am working on a ballet production of the nutcracker that will premier next november. have you seen it before live?', "speaker 2: i haven't that sounds so cool. where do you perform? i would love to see you live. ", 'speaker 1: we have a theatre we perform at in virginia. the theatre is over 150 years old.  what happens when you eat peanuts?', 'speaker 2: i go into anaphylactic shock. i have to be very careful but i carry around an epipen which can save me for about 15 minutes. '], 'persona_list': ['Speaker 2 is looking for someone bright to talk to.', 'Speaker 2 enjoys swimming in the ocean and looking for sharks.', 'Speaker 2 likes reading moby dick and dancing.', 'Speaker 2 loves the beatles and ballet.', 'Speaker 2 enjoys making jokes about farting.', 'Speaker 1 is shy.', 'Speaker 1 is allergic to peanuts.', 'Speaker 1 enjoys eating all other vegetables.', 'Speaker 1 has severe family issues (related to farting).', "Speaker 1 is not a big meat eater, but it's not a huge deal."]}
{'current': ['speaker 1: how was rehearsal? when is your next performance?', 'speaker 2: tomorrow after i met the man of my dreams its a date i love him , could i book a appointment to have make up done with you for the date ? ', "speaker 1: of course! we could also document it for youtube if you don't mind? so did you meet him during rehearsal, tell me all about him.", 'speaker 2: that would be great ! well he is 6ft 7 handsome and very funny i met him at the community theatre a while ago now its a shame you have never been in love you will find some one soon ', "speaker 1: he sounds dreamy, is he an actor too? hopefully. maybe i need to find a hobby, i don't get the chance to meet many guys doing my blogging. i should become an actress lol", 'speaker 2: yes he started around the same time as me , yeah maybe you should try acting you never know you could end up being a actor in titanic 2 or something, do you make much money from your youtube blogging ? ', "speaker 1: it's nice you have something in common. not really it is more of a hobby. i should maybe try and get into doing makeup in films and tv and hopefully some gorgeous actor will fall in love with me!", "speaker 2: yes hollywood can never get enough makeup artists that's a great idea ", "speaker 1: that's it, that's my new career ambitions sorted. i think i'll blogging about it. we can do that when i am doing your makeup!", 'speaker 2: cool ! can i have a discount as well that would be great ', "speaker 1: i don't normally give out discounts, even for friends and family. but i suppose i could make an exception since he is the man of your dreams! so where are you going for your date?", 'speaker 2: thank you so much ! and as for the date we are going to the zoo i can not wait '], 'persona_list': ["Speaker 2 does people's makeup and posts them on youtube.", 'Speaker 2 has 50 thousand followers on youtube.', 'Speaker 2 is interested in theatre.', 'Speaker 1 is an actor and does stage makeup.', "Speaker 1 is in love with someone who doesn't seem to know they exist.", 'Speaker 1 has issues going on in their life and is ignoring them.', 'Speaker 1 is busy with medical school.', 'Speaker 1 enjoys community theatre.']}
{'current': ['speaker 1: how is the moving arrangement going on? do you find a place to live in arizona?', 'speaker 2: no not yet, no place will allow two dogs to stay in the apartment', "speaker 1: are you looking for other places to live. i've heard new mexico is a nice state to live in.", 'speaker 2: new mexico does have good hiking trails, have you been to new mexico?', 'speaker 1: yes i have! it is a beautiful state and very underrated. ', 'speaker 2: where have you been in new mexico?', "speaker 1: i've been to los alamos and sandia heights in albuquerque.", 'speaker 2: which was your favorite place?', 'speaker 1: sandia heights is very beautiful. i would love to live there.', 'speaker 2: it would be very nice, i also hear they have great food. ', 'speaker 1: yes they do. what is your favorite vacation destination?', 'speaker 2: i enjoy traveling to europe, my favorite country is spain'], 'persona_list': ['Speaker 2 loves pizza', 'Speaker 2 is a nomad and travels the us living in cars', 'Speaker 2 pretends to be a slice of pizza for fun', 'Speaker 2 enjoys role-playing for pleasure', 'Speaker 1 does not like pizza', 'Speaker 1 has border collies that eat pizza', 'Speaker 1 loves animals and takes them hiking', 'Speaker 1 is a performance artist', 'Speaker 1 is moving from texas to arizona next month and is freaked out', 'Speaker 1 prefers cold winters']}
{'current': ["speaker 1: i've got to tell you about this book we're reading.", 'speaker 2: what is the name of it?', "speaker 1: it's called twilight, have you ever heard of it? it's about vampires.", 'speaker 2: i actually have heard about it. i have seen the first movie of the series.', "speaker 1: they made a movie about it???? i didn't know that. was it any good (no spoilers though!)?", "speaker 2: it actually was really good but i don't know how close it was to the book.", "speaker 1: it's all very exciting so far. lots of blood. is that the type of movie that you'd normally watch?", "speaker 2: i like the mystery genre, but i'm not crazy about vampires or blood.", "speaker 1: cool! i end up watching kid's movies most of the time. whatever keeps the little ones happy while i get things done.", 'speaker 2: i love watching animated movies. lion king is one of my all time favorites.', 'speaker 1: it makes me cry every time. have you ever thought about making a movie of your own?', "speaker 2: i haven't because that would take a lot of time, money and expertise."], 'persona_list': ['Speaker 2 is a soccer mom.', 'Speaker 2 has a lot of responsibilities (4 book clubs, pta, other groups).', 'Speaker 2 dreams of ditching everything and flying to paris to design clothes.', 'Speaker 1 is a 32-year-old who still lives at home.', 'Speaker 1 is a general in a video game for an orcish army.', 'Speaker 1 enjoys playing video games and watching netflix.', 'Speaker 1 might join speaker 1 in their dream of ditching everything and flying to paris.']}
{'current': ["speaker 1: how's your allergies going? is your cat still messing with you?", "speaker 2: ha, yes! he woke me up last night, so i'm tired. otherwise good - my allergies tend to be manageable this time of year. how are yours?", 'speaker 1: my allergies is not that severe.', "speaker 2: that's good! i live in a city where they plant all sorts of non-native plants every year, so it tends to make allergies worse in the spring and summer. what's your cat's name?", 'speaker 1: sorry about that, maybe you can change neighborhood.', "speaker 2: i probably won't, i like my neighborhood more than i hate my allergies. my cat is called smalls, but he is overweight.", "speaker 1: you can change small's ration to correct that. my cat is called bim.", 'speaker 2: cute. yes, the vet suggested va special food as well but he tends to yowl all night if i reduce his food.', 'speaker 1: he will soon get adapted to changes in the the feeding system did not continie', 'speaker 2: i hope so. i love him and want him to be around forever. does your sister live close to you?', 'speaker 1: yes, we are living together in the same apartment. ', 'speaker 2: what fun. do you have dinner together every night?'], 'persona_list': ['Speaker 2 has a sister who is acting like their mom', 'Speaker 2 has a cat that is crazy and wants to quit their job to stay home with them', 'Speaker 2 has clutter and still has a photo from their senior year in their wallet', 'Speaker 2 hates waiting in line and wants to become a roadie for justin bieber', 'Speaker 1 has allergies that are acting up', 'Speaker 1 loves their cat but the cat messes with their allergies', 'Speaker 1 has too much clutter and it drives them nuts', 'Speaker 1 takes a long time to get ready for work', 'Speaker 1 wants to quit their job and become a roadie for justin bieber and ghost', 'Speaker 1 wants a vacation from the clutter']}
{'current': ["speaker 1: what it's like to be a police officer? do you like what you do? have you ever found bones during an investigation? ", "speaker 2: being a police officer is a very hard job. but it's also so rewarding getting to help people every day.", "speaker 1: to be honest, most of my encounters with police officers haven't been very helpful.", "speaker 2: that's awful to hear. i'm sorry you haven't had good experiences. we aren't all bad though. i promise. also to answer your earlier question, yes i have found bones during an investigation. it was quite an interesting case. ", 'speaker 1: human bones? tell me more please!', 'speaker 2: unfortunately they were human. we were called out for a small coming from under someones house and we found the body when we started our search. someone got stuck while trying to hide after a robbery. such a sad situation. ', "speaker 1: i guess if it had to be anyone's bones, best be those of the criminal instead of a victim?", "speaker 2: that's one way to look at it. so tell me more about what you've found in peoples bodies doing xrays!  i bet you have many interesting stories to tell", "speaker 1: well, not surprisingly, the most commonly found things are, how shall i put this, things inserted in the body that weren't intended to be left there, but somehow they were.", "speaker 2: what's the biggest item you've found?", "speaker 1: actually had one idiot choke down half a garden hose on a dare. in terms of that other category, i'll just stay silent. you're better off not knowing.", "speaker 2: oh wow. that's.. impressive. but now you have me more curious about the other category. i need to know now!!"], 'persona_list': ['Speaker 2 enjoys watching the history channel.', 'Speaker 2 has a cat named sir kitty winkles.', 'Speaker 2 works as an x-ray tech.', 'Speaker 2 plays softball for fun.', 'Speaker 1 plays video games and chats.', 'Speaker 1 has two wonderful dogs.', 'Speaker 1 is a trained police officer.', 'Speaker 1 enjoys taking hunting trips with his brothers.']}
{'current': ['speaker 1: hey there, you up to play some online card games together? ', 'speaker 2: sure that would be fun. what games do you like?', 'speaker 1: i like to play poker or black jack. do you have a preference?', "speaker 2: i like both but i'm probably better at black jack!", 'speaker 1: yeah so am i. i usually like to play other kinds of video games, but i feel like playing cards together would be much easier!', 'speaker 2: probably! what other kinds of games do you like?', 'speaker 1: i like playing first person shooter games on playstation. do you like to play any video games like that?', "speaker 2: i've played some call of duty but i'm not very good at it lol", 'speaker 1: lol i like call of duty. what kind of music are you into?', 'speaker 2: i like just about all types of music but probably into rock and country the most. do you play any instruments? ', 'speaker 1: rock music is my favorite! i tried playing guitar once but it didnt work out, it was too hard lol, what about you?', "speaker 2: i play a little acoustic guitar, badly lol i'd like to take lessons to see if i can get any better but i've been using youtube videos to learn"], 'persona_list': ['Speaker 2 loves playing video games (all genres)', 'Speaker 2 has never worked, mother is wealthy (apple)', 'Speaker 2 lives outside of orlando, florida', 'Speaker 1 watches the news at home', 'Speaker 1 just quit their job and is about to apply to university', 'Speaker 1 likes to go skiing', 'Speaker 1 plays card games', 'Speaker 1 lives on the mississippi gulf coast (hour away from pensacola)', 'Speaker 1 travels to new orleans occasionally']}
{'current': ['speaker 1: hey hows it going, any new cosplay ideas lately?', "speaker 2: i haven't really, i've been neglecting it recently which isn't like me. have you managed to get any further with starting the band? ", "speaker 1: yeah, i finally found a bass player! just need a good drummer and we're set. you should do a game of thrones character!", 'speaker 2: you are so close in that case! what will you do in the band? i should, good idea! ', 'speaker 1: well, i want to mash up metal and traditional irish music. try to picture a heavy metal sea shanty. does that sound awful or interesting?', "speaker 2: wow that's unusual, i like the sound of that. no definitely interesting! what a niche! so how long have you been a vegan for? i keep trying to adopt the lifestyle but i'm not committed enough yet. ", "speaker 1: my parents were vegan, so it is really all i've ever known. i recommend taking baby steps, though. maybe start by cutting out red meat first, then all meat, then cheese, etc. what motivated you to want to go vegan?", "speaker 2: that's the best way i think, it's hard to transition once you have lived with meat your whole life. baby steps is a good idea. i'm mainly interested from the environmental perspective, but i also feel guilty about eating meat. do you enjoy the meat alternatives that are available? can you recommend any?", "speaker 1: i've tried them, and they're fine, but for me it is about showcasing vegetables, not trying to replace or substitute meat. what are your favorite vegetables?", 'speaker 2: okay, sure. that makes sense. i love broccoli and avocado. what are your favourites? ', 'speaker 1: i love broccoli too, but am allergic to avocados! i also love carrots, bok choi, potatoes and asparagus.', "speaker 2: omg, i didn't realise people could be allergic to avocados, have you always been or did your allergy develop as an adult? i agree with asparagus. love it. "], 'persona_list': ['Speaker 2 is trying to start a band like system of a down.', 'Speaker 2 is a vegan and finds it offensive to their cult.', 'Speaker 2 has been playing coldplay on the piano since they were 6.', 'Speaker 2 meant to write "culture" but finds it fitting to say "cult".', 'Speaker 2 thinks cosplay is better than game of thrones.', 'Speaker 2 is trying to fool someone.', 'Speaker 1 is awesome and works at home.', 'Speaker 1 loves game of thrones and finds it their favorite show ever.', 'Speaker 1 thinks everything is some kind of cult, including renaissance fairs.', 'Speaker 1 listens to coldplay sometimes when they work at home.', 'Speaker 1 finds it fitting to say "cult or culture".', 'Speaker 1 thinks system of a down has a few good songs.']}
